-- phpMyAdmin SQL Dump
-- version 3.4.5
-- http://www.phpmyadmin.net
--
-- Хост: localhost
-- Время создания: Май 04 2021 г., 15:41
-- Версия сервера: 5.5.16
-- Версия PHP: 5.3.8

SET SQL_MODE="NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `bnexample1`
--

-- --------------------------------------------------------

--
-- Структура таблицы `flexcalculation1`
--

CREATE TABLE IF NOT EXISTS `flexcalculation1` (
  `ID` int(11) NOT NULL AUTO_INCREMENT,
  `Менеджер` text CHARACTER SET koi8r NOT NULL,
  `Дата` date NOT NULL,
  `Наименование заказа` text CHARACTER SET koi8r NOT NULL,
  `Тип бумаги, пленки` text CHARACTER SET koi8r NOT NULL,
  `Ширина этикетки (мм2)` float NOT NULL,
  `Высота этикетки (мм2)` float NOT NULL,
  `Общее количество этикеток (тираж)` float NOT NULL,
  `Количество этикеток на валу` float NOT NULL,
  `Красочность (число красок)` float NOT NULL,
  `Рапорт вала (мм)` float NOT NULL,
  `Ширина роля бумаги (мм)` float NOT NULL,
  `Цена бумаги за м2` float NOT NULL,
  `Формы` int(11) NOT NULL DEFAULT '1' COMMENT '1-Наши, 2-Репропарк',
  `Стоимость бумаги вместе с приладкой (руб)` float NOT NULL,
  `Стоимость пленок (руб)` float NOT NULL,
  `Стоимость форм (руб)` float NOT NULL,
  `Стоимость тиража (руб)` float NOT NULL,
  `Погонные метры плюс приладка (м)` float NOT NULL,
  `Квадратные метры (м2)` float NOT NULL,
  `Площадь этикетки (мм2)` float NOT NULL,
  `Итого, себестоимость (руб)` float NOT NULL,
  `Прибыль (%)` float NOT NULL,
  `Прибыль (руб)` float NOT NULL,
  `Общая стоимость (руб)` float NOT NULL,
  `Цена за этикетку (руб)` float NOT NULL,
  `Общее количество этикеток (штук)` float NOT NULL,
  `Рентабельность (%)` float NOT NULL,
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB  DEFAULT CHARSET=latin1 AUTO_INCREMENT=25 ;

--
-- Дамп данных таблицы `flexcalculation1`
--

INSERT INTO `flexcalculation1` (`ID`, `Менеджер`, `Дата`, `Наименование заказа`, `Тип бумаги, пленки`, `Ширина этикетки (мм2)`, `Высота этикетки (мм2)`, `Общее количество этикеток (тираж)`, `Количество этикеток на валу`, `Красочность (число красок)`, `Рапорт вала (мм)`, `Ширина роля бумаги (мм)`, `Цена бумаги за м2`, `Формы`, `Стоимость бумаги вместе с приладкой (руб)`, `Стоимость пленок (руб)`, `Стоимость форм (руб)`, `Стоимость тиража (руб)`, `Погонные метры плюс приладка (м)`, `Квадратные метры (м2)`, `Площадь этикетки (мм2)`, `Итого, себестоимость (руб)`, `Прибыль (%)`, `Прибыль (руб)`, `Общая стоимость (руб)`, `Цена за этикетку (руб)`, `Общее количество этикеток (штук)`, `Рентабельность (%)`) VALUES
(1, 'Аристофан 2', '2019-07-09', 'Халва', 'Пленка ПП', 70, 80, 10000, 12, 3, 217.3, 500, 3.5, 1, 585.734, 851.432, 5923.01, 2471.66, 334.705, 167.352, 5600, 9831.83, 100, 9831.83, 19663.7, 1.96637, 10000, 0),
(2, 'Чайник', '2019-05-08', 'Хлеб', 'БПП', 20, 40, 30000, 10, 4, 256.5, 400, 4, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 220),
(3, 'Фельдмаршал', '2019-05-08', 'Пряники 12', 'Просто бумага', 10, 12, 80000, 10, 8, 320, 200, 1.56, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 230),
(4, 'Аристофан', '2019-05-10', 'Соки15', 'Жемчужка', 65, 45, 120000, 5, 6, 400.7, 500, 5.3, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 240),
(5, 'Фельдмаршал', '2019-05-15', 'Картошка в пакетиках', 'ПЭТ', 120, 240, 1000000, 5, 4, 430, 780, 2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(6, 'Друшлаг', '2019-05-15', 'Макароны сушеные', 'Глянец газетный', 100, 200, 2500400, 11, 2, 543.21, 800, 3.2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(7, 'Аристофан', '2019-05-16', 'Есентуки17', 'БЭП', 100, 10, 200000, 5, 8, 435.76, 750, 5.9, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(8, 'Друшлаг', '2019-05-15', 'Фисташки синие', 'ХБ', 140, 150, 5000000, 8, 2, 415.7, 650, 6.32, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(9, 'Фельдмаршал', '2019-05-16', 'Лимонад бодрящий', 'Пленка 0.23 мкм', 400, 100, 20000000, 4, 8, 231.12, 740, 10, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(10, 'Крокодейл 2', '2019-05-09', 'New Product', 'Plenka', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(11, 'New Menedjer', '2019-05-09', 'New Product', 'Plenka', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(12, 'Men2', '2019-05-09', 'New Product', 'Бумага 2', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(13, 'Крокодейл 2', '2019-05-09', 'New Product', 'Бумага 2', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(14, 'Крокодейл 2', '2019-05-09', 'New Product', 'Бумага 2', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(15, 'Frost 17', '2019-07-07', 'New Product', 'Plenka', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(16, 'New Menedjer 75', '2019-07-09', 'New Product 78', 'Просто бумага', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(17, 'Хохлома 89', '2019-07-01', 'Масло сливочное 37', 'Обыкновенная бумага 0.35', 777, 808, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(18, 'New Menedjer 555', '2019-07-01', 'New Product 555', 'Plenka 555', 70, 88, 10000, 10, 8, 310.34, 500, 3.5, 1, 1253.96, 3160.69, 21987.4, 7440.4, 716.547, 358.273, 6160, 33842.5, 70, 23689.7, 57532.2, 5.75322, 10000, 0),
(19, 'New111', '2019-07-09', 'New Product111', 'Plenka 111', 10, 20, 2000, 22, 1, 218.37, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(20, 'New 222', '2019-07-09', 'New Product222', 'Plenka 222', 22, 42, 20000, 22, 6, 222.3, 222, 2.5, 1, 280.904, 809.185, 5629.11, 4683.09, 506.133, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(21, 'New Menedjer 456', '2019-05-09', 'New Product', 'Plenka', 70, 80, 10000, 12, 3, 217.3, 500, 3.5, 1, 585.734, 851.432, 5923.01, 2471.66, 334.705, 167.352, 5600, 9831.83, 100, 9831.83, 19663.7, 1.96637, 10000, 320),
(22, 'New Menedjer', '2019-05-09', 'New Product', 'Plenka', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(23, 'New Menedjer', '2019-05-09', 'New Product', 'Plenka', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(24, 'New Menedjer', '2019-10-23', 'New Product', 'Plenka', 70, 80, 1000, 12, 3, 217.3, 500, 3.5, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `tabl1`
--

CREATE TABLE IF NOT EXISTS `tabl1` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `Наименование заказа` text NOT NULL,
  `Размер этикетки` text NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1 AUTO_INCREMENT=1 ;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
